iuclid-i5ws/src/main/resources/net/idea/i5/cli/session/login.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:typ="http://echa.europa.eu/schemas/iuclid5/i5webservice/types/">
   <soap:Header/>
   <soap:Body>
      <typ:login>
      <!--  username and md5 hash of the password -->
         <typ:credentials typ:username="%s" typ:password="%s"/>
      </typ:login>
   </soap:Body>
</soap:Envelope>